#+PROPERTY: header-args:sql :engine "postgresql" :dbuser postgres :dbpassword "password" :database database :dbhost 127.0.0.1

#+BEGIN_QUOTE
This document is meant to be run interactively. If you'd like to follow along, open up your version Emacs, move your cursor to a code block then press ~C-c C-c~ to run it.
#+END_QUOTE

*** Check for schema existence
Knowing about the existence of ~pg_namespace~ gives us the ability to understand the first section of code
#+begin_src sql
-- Check that source_schema exists
    SELECT oid INTO src_oid
      FROM pg_namespace
     WHERE nspname = quote_ident(source_schema);
    IF NOT FOUND
      THEN 
      RAISE NOTICE 'source schema % does not exist!', source_schema;
      RETURN ;
        END IF;

    -- Check that dest_schema does not yet exist
    PERFORM nspname 
      FROM pg_namespace
     WHERE nspname = quote_ident(dest_schema);
    IF FOUND
      THEN 
      RAISE NOTICE 'dest schema % already exists!', dest_schema;
      RETURN ;
    END IF;

    EXECUTE 'CREATE SCHEMA ' || quote_ident(dest_schema) ;
#+end_src

Unfortunately, in it's current form, we can't really run that SQL. Let's make it a function so we can normalize the results:
#+NAME: Check that source_schema exists
#+begin_src sql
  CREATE OR REPLACE FUNCTION check_existence(
    source_schema text)
    RETURNS bool AS $BODY$
  BEGIN
  
   PERFORM oid
      FROM pg_namespace
     WHERE nspname = quote_ident(source_schema);
    IF NOT FOUND
    THEN
      RAISE NOTICE 'source schema % does not exist!', source_schema;
      RETURN false;
    ELSE
      RETURN true;
    END IF;
  END;
  $BODY$

  LANGUAGE plpgsql VOLATILE
  COST 100;

  SELECT check_existence('primary');
#+end_src

#+RESULTS: Check that source_schema exists
| CREATE FUNCTION |
|-----------------|
| check_existence |
| t               |

We can also check for non existence of a schema
#+NAME: Check that the dest schema doesn't exist
#+begin_src sql
  SELECT check_existence('secondary');
#+end_src
**** Copy Sequence Values
We can translate:
#+begin_src sql
    EXECUTE 'SELECT last_value, max_value, start_value, increment_by, min_value, cache_value, log_cnt, is_cycled, is_called 
    FROM ' || quote_ident('primary') || '.' || quote_ident(object) || ';' 
    INTO sq_last_value, sq_max_value, sq_start_value, sq_increment_by, sq_min_value, sq_cache_value, sq_log_cnt, sq_is_cycled, sq_is_called ; 
#+end_src

To:
#+begin_src sql
  SELECT last_value AS sq_last_value, max_value AS sq_max_value, start_value AS sq_start_value, increment_by AS sq_increment_by,
         min_value AS sq_min_value, cache_value AS sq_cache_value, log_cnt AS sq_log_cnt, is_cycled AS sq_is_cycled,
         is_called AS sq_is_called
  FROM primary.records_id_seq;
#+end_src

#+RESULTS:
| sq_last_value |        sq_max_value | sq_start_value | sq_increment_by | sq_min_value | sq_cache_value | sq_log_cnt | sq_is_cycled | sq_is_called |
|---------------+---------------------+----------------+-----------------+--------------+----------------+------------+--------------+--------------|
|            57 | 9223372036854775807 |              1 |               1 |            1 |              1 |          9 | f            | t            |

Now because of how sql works we have to convert data from a boolean to a string. So we translate the value ~sq_is_cycled~ from a boolean to a string.

#+begin_src sql
    IF sq_is_cycled
      THEN 
        sq_cycled := 'CYCLE';
    ELSE
        sq_cycled := 'NO CYCLE';
    END IF;
#+end_src

If we could actually run that code we would see that records_id_seq is not cycled and we get ~'NO CYCLE'~.

So now we want to copy over the data from ~primary.records_id_seq~ to ~secondary.records_id_seq~
#+begin_src sql
    ALTER SEQUENCE secondary.records_id_seq
            INCREMENT BY 1 
            MINVALUE     1
            MAXVALUE     9223372036854775807
            START WITH   1
            RESTART      1
            CACHE        1
            NO CYCLE;
#+end_src

Then because we're cloning all the meta information and the records themselves, we need to setting
#+begin_src sql
SELECT setval( 'secondary.records_id_seq', 58, true);
#+end_src

And now we just do that like... 50 more times.

#+begin_src sql
  do $$
  FOR object IN
        SELECT sequence_name::text 
          FROM information_schema.sequences
          WHERE sequence_schema = quote_ident(source_schema)
      LOOP
        EXECUTE 'CREATE SEQUENCE ' || quote_ident(dest_schema) || '.' || quote_ident(object);
        srctbl := quote_ident(source_schema) || '.' || quote_ident(object);

        EXECUTE 'SELECT last_value, max_value, start_value, increment_by, min_value, cache_value, log_cnt, is_cycled, is_called 
                  FROM ' || quote_ident(source_schema) || '.' || quote_ident(object) || ';' 
                  INTO sq_last_value, sq_max_value, sq_start_value, sq_increment_by, sq_min_value, sq_cache_value, sq_log_cnt, sq_is_cycled, sq_is_called ; 

        IF sq_is_cycled 
          THEN 
            sq_cycled := 'CYCLE';
        ELSE
            sq_cycled := 'NO CYCLE';
        END IF;

        EXECUTE 'ALTER SEQUENCE '   || quote_ident(dest_schema) || '.' || quote_ident(object) 
                || ' INCREMENT BY ' || sq_increment_by
                || ' MINVALUE '     || sq_min_value 
                || ' MAXVALUE '     || sq_max_value
                || ' START WITH '   || sq_start_value
                || ' RESTART '      || sq_min_value 
                || ' CACHE '        || sq_cache_value 
                || sq_cycled || ' ;' ;

        buffer := quote_ident(dest_schema) || '.' || quote_ident(object);
        IF include_recs 
            THEN
                EXECUTE 'SELECT setval( ''' || buffer || ''', ' || sq_last_value || ', ' || sq_is_called || ');' ; 
        ELSE
                EXECUTE 'SELECT setval( ''' || buffer || ''', ' || sq_start_value || ', ' || sq_is_called || ');' ;
        END IF;

      END LOOP;
  $$
  END;
#+end_src

